package day21_interface수업3;

public class 라면자판기 {
	
	
//	---사용자가 실제로 관심있는 건-----이걸 interface 입장에서----------------------------
//	get라면(int 돈)
//	{
//		
//	}
//	
//	get나무젓가락()
//	{
//		
//	}
	
//	----개발자가 힘 빡주고 만들어도 --------------------------------
	
//	boolean 물끓이기(int 온도)
//	{
//		
//	}
//	
//	int 라면선택()
//	{
//		
//	}
//	
//	int 봉지쾌속까기()
//	{
//		
//	}
//	
//	int 물붓기()
//	{
//		
//	}
//	
//	int 기다리기(int 초, String 음악)
//	{
//		
//	}
//	
//	int 제공(boolean is나무젓가락)
//	{
//		
//	}
	
	
}
